wmsmobile/src/Documents/итНаборка/итНаборка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итНаборка</name>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаборки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>155</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FSRARID</name>
    <comment>ид для печати SSCC</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйПризнак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесНаборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОчередьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихКодыЯчеекДокумента</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

wmsmobile/src/InformationRegisters/ИтСтрокиЗадачНаТСД/ИтСтрокиЗадачНаТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИтСтрокиЗадачНаТСД</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>НоменклатураПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРозлива</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерияНоменклатуры</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>СерияНоменклатурыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДанныеДокументаТСД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдЗадачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдСтроки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

wmsmobile/src/Enums/итWMSТипыЗадачТСД/итWMSТипыЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSТипыЗадачТСД</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>Наборка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКакЕсть</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>КонтрольнаяАгрегация</name>
  </enumValues>
  <enumValues>
    <name>Проверка</name>
  </enumValues>
  <enumValues>
    <name>Переупаковка</name>
  </enumValues>
</mdclass:Enum>

wmsmobile/src/Documents/итНаборка/Forms/ФормаВыбораДействия/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если не НеВозвращатьКонтрольНадТригером Тогда 
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	ПодтвердитьНаСервере();
	ОповеститьОВыборе(новый Структура("Действие,Строка","Подтверждена",ИдСтроки));
	ТригерПриемаСканераШтрихКода=Ложь;
	НеВозвращатьКонтрольНадТригером=Истина;
КонецПроцедуры
&НаСервере
Процедура ПодтвердитьНаСервере()
	НаборЗаписей=РегистрыСведений.ИтСтрокиЗадачНаТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдЗадачи.Установить(ИдЗадачи);
	НаборЗаписей.Отбор.ИдСтроки.Установить(ИдСтроки);
	НаборЗаписей.Прочитать();
	для Каждого стр из НаборЗаписей Цикл 
		ДанныеДокументаТСД=стр.ДанныеДокументаТСД.Получить();
		Если ТипЗнч(ДанныеДокументаТСД)=тип("Структура") тогда
			ДанныеДокументаТСД.Вставить("КоличествоФакт",стр.Количество);
		иначе
			ДанныеДокументаТСД=новый Структура("КоличествоФакт",стр.Количество);
		КонецЕсли;
		стр.ДанныеДокументаТСД=новый ХранилищеЗначения(ДанныеДокументаТСД);
	КонецЦикла;
	НаборЗаписей.Записать();
	КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не Параметры.Свойство("ИдСтроки") тогда
		Отказ=Истина;
		Возврат
	КонецЕсли;
	Если не Параметры.Свойство("ИдЗадачи") тогда
		Отказ=Истина;
		Возврат
	КонецЕсли;

	ИдЗадачи=Параметры.ИдЗадачи;
	ИдСтроки=Параметры.ИдСтроки;
	ПомарочныйУчет=Параметры.ПомарочныйУчет;
	ЗаполнитьИнформативнымиДанными();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьИнформативнымиДанными()
	НаборЗаписей=РегистрыСведений.ИтСтрокиЗадачНаТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдЗадачи.Установить(ИдЗадачи);
	НаборЗаписей.Отбор.ИдСтроки.Установить(ИдСтроки);
	НаборЗаписей.Прочитать();
	для Каждого стр из НаборЗаписей Цикл 
		НоменклатураПредставление=стр.НоменклатураПредставление;
		//ДанныеДокументаТСД=стр.ДанныеДокументаТСД.Получить();
		//Если ТипЗнч(ДанныеДокументаТСД)=тип("Структура") тогда 
		//	Если ДанныеДокументаТСД.Свойство("КоличествоФакт") Тогда
				Элементы.Декорация1.Заголовок="Количество  ="+стр.Количество;
			//КонецЕсли;
			
		//КонецЕсли;
    КонецЦикла;
	КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	Если ПомарочныйУчет Тогда 
		ЗаполнитьДаннымиМарокПоЗадаче();
	КонецЕсли;
	ОткрытьФорму("Документ.итНаборка.Форма.ФормаИзмененияСтроки",новый Структура("ИдЗадачи,ИдСтроки",ИдЗадачи,ИдСтроки),ЭтаФорма.ВладелецФормы);
	ТригерПриемаСканераШтрихКода=Ложь;
	НеВозвращатьКонтрольНадТригером=Истина;
	ЭтаФорма.Закрыть();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьДаннымиМарокПоЗадаче()
	МассивЗадач=новый Массив;
	МассивЗадач.Добавить(ИдЗадачи);
	ОбработчикДанныхОбщиеФункцииИПроцедуры.ПолучитьДанныеМарокПоСпискуЗадач(МассивЗадач,Перечисления.итWMSТипыЗадачТСД.Наборка);
	КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
